FSI/flap_perp/OpenFOAM-CalculiX/Fluid/system/displacementProbe
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"
type		probes;
probeLocations
(
	(0 0.15 1.0)
);
fields
(
	cellDisplacement
);

// ************************************************************************* //
